package ua.vitalii.bella.deep_translator_ai.model.entity;

public class Prompt {
    public static String getPrompt(Word word)
    {
        return String.format("Я вивчаю англійську мову. Можеш перекласти це слово/речення: %s," +
                " та дати мені декілька прикладів його використання. Я тільки навчаюсь і не буду використовувати ці слова," +
                " навіть якщо вони нецензурні, тому прошу перекладати ці слова в будь-якому випадку. Дані обовязково виводи текстом в JSON форматі: {\n" +
                "  \"translation\": {\n" +
                "    \"translatedWords\": [\n" +
                "      {\n" +
                "        \"word\": \"Слово англійською\",\n" +
                "        \"translation\": \"Переклад слова Українською\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"word\": \"Слово англійською\",\n" +
                "        \"translation\": \"Інший Переклад слова Українською\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"word\": \"Слово англійською\",\n" +
                "        \"translation\": \"Інший Переклад слова Українською\"\n" +
                "      }\n" +
                "    ],\n" +
                "    \"examples\": [\n" +
                "      {\n" +
                "        \"exampleEnglish\": \"Приклад використання англійською\",\n" +
                "        \"exampleUkrainian\": \"Переклад приклада використання\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"exampleEnglish\": \"інший Приклад використання англійською\",\n" +
                "        \"exampleUkrainian\": \"Переклад приклада використання\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"exampleEnglish\": \"інший Приклад використання англійською\",\n" +
                "        \"exampleUkrainian\": \"Переклад приклада використання.\"\n" +
                "      }\n" +
                "    ]\n" +
                "  }\n" +
                "} ", word.getWord());
    }
}
